[
    {
		"id": "Page 1",
		"page": 1,
		"contents": "Today’s Internet is arguably the largest engineered system ever created by  mankind,  with hundreds of millions of connected computers, communication links, and   switches; with billions of users who connect via laptops, tablets, and smartphones;  and with an array of new Internetconnected “things” including game consoles, surveillance systems, watches, eye glasses, thermostats, and cars. Given that the Inter  net is so large and has so many diverse components and uses, is there any hope of understanding how it works? Are there guiding principles and structure that can provide a foundation for understanding such an amazingly large and complex sys  tem? And if so, is it possible that it actually could be both interesting and fun to  learn about computer networks? Fortunately, the answer to all of these questions is a resounding YES! Indeed, it’s our aim in this book to provide you with a modern introduction to the dynamic field of computer networking, giving you the princi  ples and practical insights you’ll need to understand not only today’s networks, but tomorrow’s as well. This first chapter presents a broad overview of computer networking and the  Internet. Our goal here is to paint a broad picture and set the context for the rest of this book, to see the forest through the trees. We’ll cover a lot of ground in this introductory chapter and discuss a lot of the pieces of a computer network, without losing sight of the big picture. We’ll structure our overview of computer networks in this chapter as follows.  After introducing some basic terminology and concepts, we’ll first examine the basic hardware and software components that make up a network. We’ll begin at the network’s edge and look at the end systems and network applications running in the network. We’ll then explore the core of a computer network, examining the links 1CHAPTER Computer  Networks and the Internet"
	},
	{
		"id": "Page 2",
		"page": 2,
		"contents": "and the switches that transport data, as well as the access networks and physical  media that connect end systems to the network core. We’ll learn that the Internet is a network of networks, and we’ll learn how these networks connect with each other. After having completed this overview of the edge and core of a computer net work, we’ll take the broader and more abstract view in the second half of this chapter. We’ll examine delay, loss, and throughput of data in a computer network and provide simple quantitative models for endtoend throughput and delay: models that take into account transmission, propagation, and queuing delays. We’ll then introduce some of the key architectural principles in computer networking, namely, protocol layering and service models. We’ll also learn that computer networks are vulnerable to many different types of attacks; we’ll survey some of these attacks and consider how computer networks can be made more secure. Finally, we’ll close this chapter with a brief history of computer networking. 1.1 What Is the Internet? In this book, we’ll use the public Internet, a specific computer network, as our principal vehicle for discussing computer networks and their protocols. But what is the  Internet? There are a couple of ways to answer this question. First, we can describe the nuts and bolts of the Internet, that is, the basic hardware and software components that make up the Internet. Second, we can describe the Internet in terms of a networking infrastructure that provides services to distributed applications. Let’s begin with the nutsandbolts description, using Figure 1.1 to illustrate our discussion. 1.1.1 A NutsandBolts Description The Internet is a computer network that interconnects billions of computing devices throughout the world. Not too long ago, these computing devices were primarily traditional desktop computers, Linux workstations, and socalled servers that store and transmit information such as Web pages and email messages. Increasingly, however, users  connect to the Internet with smartphones and tablets—today, close to half of the world’s population are active mobile Internet users with the percentage expected to increase to 75% by 2025 [Statista 2019]. Furthermore, nontraditional Internet “things” such as TVs, gaming consoles, thermostats, home security systems, home appliances, watches, eye glasses, cars, traffic control systems, and more are being connected to the Internet. Indeed, the term computer network is beginning to  sound a bit dated, given the many nontraditional devices that are being hooked up to the Internet. In Internet jargon, all of these devices are called hosts or end systems.  By some estimates, there were about 18 billion devices connected to the Internet in 2017, and the number will reach 28.5 billion by 2022 [Cisco VNI 2020]."
	},
	{
		"id": "Page 3",
		"page": 3,
		"contents": "Figure 1.1  /uni2666 Some pieces of the Internet Key: Trafﬁc light Thermostat Fridge Datacenter WorkstationHost (= end system)Mobile ComputerBase stationRouter Cell phone towerSmartphone or tabletLinklayer switchServerContent Provider NetworkNational or Global ISP Datacenter Networ k Datacenter Networ kMobile Network Enterprise NetworkHome NetworkLocal or Regional ISP"
	}
]